spec/support/vcr_cassettes/preneeds/states/gets_a_list_of_states.yml

---
http_interactions:
- request:
    method: post
    uri: "<PRENEEDS_HOST>/eoas_SOA/PreNeedApplicationPort"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://service.soa.eoas.cem.va.gov/"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:getStates></tns:getStates></env:Body></env:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 16 Jun 2017 02:16:24 GMT
      Transfer-Encoding:
      - chunked
      Content-Type:
      - multipart/related;start="<rootpart*18d12c21-ef5e-47f2-8601-7c448fbfa830@example.jaxws.sun.com>";type="application/xop+xml";boundary="uuid:18d12c21-ef5e-47f2-8601-7c448fbfa830";start-info="text/xml"
    body:
      encoding: UTF-8
      string: "--uuid:18d12c21-ef5e-47f2-8601-7c448fbfa830\r\nContent-Id: <rootpart*18d12c21-ef5e-47f2-8601-7c448fbfa830@example.jaxws.sun.com>\r\nContent-Type:
        application/xop+xml;charset=utf-8;type=\"text/xml\"\r\nContent-Transfer-Encoding:
        binary\r\n\r\n<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><ns2:getStatesResponse
        xmlns:ns2=\"http://service.soa.eoas.cem.va.gov/\"><return><code>DE</code><firstFiveZip>19700</firstFiveZip><lastFiveZip>19999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>DELAWARE</name></return><return><code>FL</code><firstFiveZip>32000</firstFiveZip><lastFiveZip>34999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>FLORIDA</name></return><return><code>GA</code><firstFiveZip>30000</firstFiveZip><lastFiveZip>31999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>GEORGIA</name></return><return><code>GU</code><firstFiveZip>96900</firstFiveZip><lastFiveZip>96999</lastFiveZip><lowerIndicator>N</lowerIndicator><name>GUAM</name></return><return><code>HI</code><firstFiveZip>96700</firstFiveZip><lastFiveZip>96899</lastFiveZip><lowerIndicator>N</lowerIndicator><name>HAWAII</name></return><return><code>IA</code><firstFiveZip>50000</firstFiveZip><lastFiveZip>52899</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>IOWA</name></return><return><code>ID</code><firstFiveZip>83200</firstFiveZip><lastFiveZip>83899</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>IDAHO</name></return><return><code>IL</code><firstFiveZip>60000</firstFiveZip><lastFiveZip>62999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>ILLINOIS</name></return><return><code>IN</code><firstFiveZip>46000</firstFiveZip><lastFiveZip>47999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>INDIANA</name></return><return><code>KS</code><firstFiveZip>66000</firstFiveZip><lastFiveZip>67999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>KANSAS</name></return><return><code>KY</code><firstFiveZip>40000</firstFiveZip><lastFiveZip>42799</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>KENTUCKY</name></return><return><code>LA</code><firstFiveZip>70000</firstFiveZip><lastFiveZip>71499</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>LOUISIANA</name></return><return><code>MA</code><firstFiveZip>01000</firstFiveZip><lastFiveZip>02799</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>MASSACHUSETTS</name></return><return><code>MD</code><firstFiveZip>20600</firstFiveZip><lastFiveZip>21999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>MARYLAND</name></return><return><code>ME</code><firstFiveZip>03900</firstFiveZip><lastFiveZip>04999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>MAINE</name></return><return><code>MI</code><firstFiveZip>48000</firstFiveZip><lastFiveZip>49999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>MICHIGAN</name></return><return><code>MN</code><firstFiveZip>55000</firstFiveZip><lastFiveZip>56799</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>MINNESOTA</name></return><return><code>MO</code><firstFiveZip>63000</firstFiveZip><lastFiveZip>65899</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>MISSOURI</name></return><return><code>MS</code><firstFiveZip>38600</firstFiveZip><lastFiveZip>39799</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>MISSISSIPPI</name></return><return><code>MT</code><firstFiveZip>59000</firstFiveZip><lastFiveZip>59999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>MONTANA</name></return><return><code>NC</code><firstFiveZip>27000</firstFiveZip><lastFiveZip>28999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>NORTH
        CAROLINA</name></return><return><code>ND</code><firstFiveZip>58000</firstFiveZip><lastFiveZip>58899</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>NORTH
        DAKOTA</name></return><return><code>NE</code><firstFiveZip>68000</firstFiveZip><lastFiveZip>69399</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>NEBRASKA</name></return><return><code>NH</code><firstFiveZip>03000</firstFiveZip><lastFiveZip>03899</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>NEW
        HAMPSHIRE</name></return><return><code>NJ</code><firstFiveZip>07000</firstFiveZip><lastFiveZip>08999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>NEW
        JERSEY</name></return><return><code>NM</code><firstFiveZip>87000</firstFiveZip><lastFiveZip>88499</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>NEW
        MEXICO</name></return><return><code>NV</code><firstFiveZip>89000</firstFiveZip><lastFiveZip>89899</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>NEVADA</name></return><return><code>NY</code><firstFiveZip>09000</firstFiveZip><lastFiveZip>14999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>NEW
        YORK</name></return><return><code>OH</code><firstFiveZip>43000</firstFiveZip><lastFiveZip>45999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>OHIO</name></return><return><code>OK</code><firstFiveZip>73000</firstFiveZip><lastFiveZip>74999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>OKLAHOMA</name></return><return><code>OR</code><firstFiveZip>97000</firstFiveZip><lastFiveZip>97999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>OREGON</name></return><return><code>PA</code><firstFiveZip>15000</firstFiveZip><lastFiveZip>19699</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>PENNSYLVANIA</name></return><return><code>PR</code><firstFiveZip>00600</firstFiveZip><lastFiveZip>00999</lastFiveZip><lowerIndicator>N</lowerIndicator><name>PUERTO
        RICO</name></return><return><code>RI</code><firstFiveZip>02800</firstFiveZip><lastFiveZip>02999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>RHODE
        ISLAND</name></return><return><code>SC</code><firstFiveZip>29000</firstFiveZip><lastFiveZip>29999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>SOUTH
        CAROLINA</name></return><return><code>SD</code><firstFiveZip>57000</firstFiveZip><lastFiveZip>57799</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>SOUTH
        DAKOTA</name></return><return><code>TN</code><firstFiveZip>37000</firstFiveZip><lastFiveZip>38599</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>TENNESSEE</name></return><return><code>TX</code><firstFiveZip>75000</firstFiveZip><lastFiveZip>79999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>TEXAS</name></return><return><code>UT</code><firstFiveZip>84000</firstFiveZip><lastFiveZip>84799</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>UTAH</name></return><return><code>VA</code><firstFiveZip>22000</firstFiveZip><lastFiveZip>24699</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>VIRGINIA</name></return><return><code>VI</code><firstFiveZip>00800</firstFiveZip><lastFiveZip>00899</lastFiveZip><lowerIndicator>N</lowerIndicator><name>VIRGIN
        ISLANDS</name></return><return><code>VT</code><firstFiveZip>05000</firstFiveZip><lastFiveZip>05999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>VERMONT</name></return><return><code>WA</code><firstFiveZip>98000</firstFiveZip><lastFiveZip>99499</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>WASHINGTON</name></return><return><code>WI</code><firstFiveZip>53000</firstFiveZip><lastFiveZip>54999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>WISCONSIN</name></return><return><code>WV</code><firstFiveZip>24700</firstFiveZip><lastFiveZip>26899</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>WEST
        VIRGINIA</name></return><return><code>WY</code><firstFiveZip>82000</firstFiveZip><lastFiveZip>83199</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>WYOMING</name></return><return><code>AK</code><firstFiveZip>99500</firstFiveZip><lastFiveZip>99999</lastFiveZip><lowerIndicator>N</lowerIndicator><name>ALASKA</name></return><return><code>AL</code><firstFiveZip>35000</firstFiveZip><lastFiveZip>36999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>ALABAMA</name></return><return><code>AR</code><firstFiveZip>71600</firstFiveZip><lastFiveZip>72999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>ARKANSAS</name></return><return><code>AZ</code><firstFiveZip>85000</firstFiveZip><lastFiveZip>86599</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>ARIZONA</name></return><return><code>CA</code><firstFiveZip>90000</firstFiveZip><lastFiveZip>96699</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>CALIFORNIA</name></return><return><code>CO</code><firstFiveZip>80000</firstFiveZip><lastFiveZip>81699</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>COLORADO</name></return><return><code>CT</code><firstFiveZip>06000</firstFiveZip><lastFiveZip>06999</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>CONNECTICUT</name></return><return><code>DC</code><firstFiveZip>20000</firstFiveZip><lastFiveZip>20599</lastFiveZip><lowerIndicator>Y</lowerIndicator><name>DISTRICT
        OF COLUMBIA</name></return><return><code>MP</code><firstFiveZip>96950</firstFiveZip><lastFiveZip>96950</lastFiveZip><lowerIndicator>N</lowerIndicator><name>SAIPAN</name></return></ns2:getStatesResponse></S:Body></S:Envelope>\r\n--uuid:18d12c21-ef5e-47f2-8601-7c448fbfa830--"
    http_version:
  recorded_at: Fri, 16 Jun 2017 02:16:24 GMT
recorded_with: VCR 3.0.3
